#+BEGIN_HTML
---
layout: post
title: Python inside Emacs
tagline: " emulate web-browser in parallel"
permalink: /emacs/spynner-installation.html
categories: [Emacs, Literate Programming]
tags: [python3, emacs, spynner, installation, Ubuntu 14.04]
---
#+END_HTML
#+STARTUP: showall
#+OPTIONS: tags:nil num:nil \n:nil @:t ::t |:t ^:{} _:{} *:t

*** Check up current Python version:
    #+BEGIN_SRC sh :exports both
    python --version
    #+END_SRC

    #+RESULTS:
    : Python 3.4.3

    Now we'll install =spynner= and its dependencies into your =venv=

*** Clone the repository
    #+BEGIN_SRC sh 
    cd /usr/local/share/DVCS/
    git clone https://github.com/makinacorpus/spynner.git
    #+END_SRC

    #+RESULTS:
    | Cloning | into | 'spynner'... |
    | spynner |      |              |

*** Switch on py3 branch
    #+BEGIN_SRC sh :results output :exports both
    cd /usr/local/share/DVCS/spynner
    git checkout py3
    git branch -a
    #+END_SRC

    #+RESULTS:
    : Already on 'py3'
    : M	run_tests.sh
    : Your branch is up-to-date with 'origin/py3'.
    :   master
    : * py3
    :   remotes/origin/HEAD -> origin/master
    :   remotes/origin/master
    :   remotes/origin/py3

*** Review the content
    #+BEGIN_SRC sh :exports both
    cd ../spynner
    ls
    #+END_SRC

    #+RESULTS:
    | bootstrap.py          |
    | b.sh                  |
    | buildout.cfg          |
    | CHANGES.rst           |
    | examples              |
    | MANIFEST.in           |
    | minitage-buildout.cfg |
    | minitage.cfg          |
    | minitage-test.cfg     |
    | README.rst            |
    | run_tests.sh          |
    | setup.cfg             |
    | setup.py              |
    | src                   |
    | test                  |

*** Run script without X11
    #+BEGIN_SRC sh :results output :exports both
    xvfb-run python spynner/myscript.py
    #+END_SRC

    #+RESULTS:
    : Noticed the search
    : Noticed the click on the browse

